{"sections":{"main":{"type":"page-default-template","disabled":true,"settings":{}},"f4d444c9-e648-41a1-8c6b-81b5438c4ae7":{"type":"image-with-text-overlay-section","settings":{"image":"shopify:\/\/shop_images\/Untitled_design_b30b5fea-fe5b-4c24-b966-41e49295515d.jpg","image_focal_point":"center center","headline_animation":"","title":"SFS Product review guidelines","subtitle":"","button_label":"","link":"","text_position":"center center","homepage_arrow":false,"parallax_effect":true,"parallax_image_height":400}},"51af9aa5-56d2-4eb8-aa06-81a0a4571893":{"type":"featured-text","settings":{"logo_width":200,"title":"","show_divider":false,"content":"<p>SET FOR SET strives to bring you only the best products that can assist you in achieving your fitness and health goals. <\/p><p>With endless supplement and equipment options online, its never been harder to cut through the noise to find the best of the best without spending countless hours searching for the right products that meet your needs.<\/p><p>We are here to act as your due diligence partner, saving you the headaches of procuring the products you’re looking for. <\/p><p>Therefore, we’ve developed a no-B.S. approach to our review procedures to deliver an unbiased, in-depth look at fitness equipment and supplements.<\/p><p>Below you’ll find a clear-cut explanation of how we rate products, ensuring you get the best for your hard-earned dollars. <\/p>","button_label":"","button_link":"","text_size":"regular_text","text_alignment":"align_left"}},"e96510f7-eedd-4a20-bd78-792d27ff6491":{"type":"featured-text","disabled":true,"settings":{"logo_width":200,"title":"Our Product Review SOP :","show_divider":true,"content":"<p>Conduct thorough research on brands’ products. <\/p><p>This includes in-depth evaluations in the following areas:<\/p>","button_label":"","button_link":"","text_size":"regular_text","text_alignment":"center"}},"56c9f64c-387c-4851-a11b-dea9ff445406":{"type":"image-text","settings":{"image":"shopify:\/\/shop_images\/set_for_set_supplement_reviews.jpg","layout":"left","title":"Supplements:","text":"<ul><li>Formulations<\/li><li>Labels<\/li><li>Efficacy<\/li><li>Possible side effects<\/li><li>Warranty<\/li><li>Price<\/li><li>Value for money<\/li><li>Customer service<\/li><\/ul>","button_label":"","button_link":"","text_alignment":"left"}},"13f5b4b8-9e94-4ea1-be58-78a021a45c07":{"type":"image-text","settings":{"image":"shopify:\/\/shop_images\/set_for_set_equipment_reviews.jpg","layout":"right","title":"Gym Equipment:","text":"<ul><li>Build quality<\/li><li>Features<\/li><li>Effectiveness<\/li><li>Warranty<\/li><li>Price<\/li><li>Value for money<\/li><li>Customer service<\/li><\/ul>","button_label":"","button_link":"","text_alignment":"left"}},"eba2c934-54e2-4b80-ad3b-ff6e42f2230f":{"type":"featured-text","settings":{"logo_width":200,"title":"SFS Five Star System ⭐⭐⭐⭐⭐","show_divider":true,"content":"<p>After a close examination of each product that we review and deem high-quality enough to make our “Best of” lists, product reviews, or product comparisons; we then rank each product based on a scale of 1-5 stars.<\/p><p>Benchmarking products against a rigorous review process allows<br\/>us to provide our readers with a clear picture of prospective products they may purchase. <\/p><p>Our end goal is to disseminate an honest assessment of products so<br\/>that our readers can expect to get the best of the best.  <\/p><p>After each product is analyzed by our expert team of personal trainers, nutritionists, and fitness enthusiasts, they are given a score from 1 to 5 stars, with 5 being the absolute best and 1 being at the low-end of the scale. <\/p><p>This scale lets readers quickly decide which products are worth their hard-earned money. <\/p><p><strong>5 Stars: <\/strong>The best available<\/p><p><strong>4-5 Stars: <\/strong>Great options for most people<\/p><p><strong>3-4 Stars:<\/strong> Meets some expectations with room for improvement<\/p><p><strong>2-3 Stars:<\/strong> Better options available<\/p><p><strong>1-2 Stars:<\/strong> Avoid purchasing <\/p>","button_label":"","button_link":"","text_size":"regular_text","text_alignment":"center"}},"005a3c72-73c5-4c7b-95db-f6b0262f672c":{"type":"featured-text","settings":{"logo_width":200,"title":"Protein Powders, Pre-Workouts & Other Supplements","show_divider":true,"content":"<p>Any time you ingest products, you should be aware of the potential benefits and side effects because your health is at stake. We take your health and safety seriously. That’s why we require medical professionals to give their feedback supplement review posts. <\/p><p>When rating supplements, from protein powders to multivitamins to fat burners, we ask the following questions:<\/p><p><strong>Ingredients:<\/strong> Is the label transparent listing ingredients?  What dosages are used?  Are there proprietary blends?<\/p><p><strong>Dosages:<\/strong> Do the ingredients in the formulation match up to clinically backed studies and the latest research?<\/p><p><strong>Efficacy:<\/strong> Do the products actually work? How long do they take to work?<\/p><p><strong>Testing: <\/strong>Are the products third-party tested? Are they produced in cGMP facilities? Are they certified NSF safe?<\/p><p><strong>Taste:<\/strong> What flavor options are available?  What’s the consensus from verified buyers on the taste?<\/p><p><strong>Price: <\/strong>Are the products priced reasonably considering the number or servings offered, ingredients, dosages used? How are they priced in comparison to other similar products?<\/p><p><strong>Guarantees:<\/strong> Does the company offer a no-risk guarantee? Can you return the product if unsatisfied?<\/p><p><strong>Shipping:<\/strong> How long does shipping take? What are the associated costs? Is it easy to track your package?<\/p><p><strong>Customer Service: <\/strong>If any issues arise, how are they dealt with? How long does it take to get a response?<\/p>","button_label":"","button_link":"","text_size":"regular_text","text_alignment":"center"}},"af7be962-c9ae-4c4d-bd25-948091e459ab":{"type":"featured-text","settings":{"logo_width":200,"title":"Fitness Equipment","show_divider":true,"content":"<p>When buying any fitness equipment, a few factors must be considered before making a purchase decision. Below are our main concerns when rating various fitness equipment.<\/p><p>One of the most crucial factors when buying fitness equipment that can range in price from under $100 to thousands of dollars is the build quality and materials used in constructing them. <\/p><p>Some of the areas we consider are:<\/p><p><strong>Materials used:<\/strong> Will the materials used in the construction last for years through consistent and intense usage?<\/p><p><strong>Features:<\/strong> Does the product allow for adjustment? Are there moving parts? What features does the product showcase that competitors may lack?<\/p><p><strong>Ease Of Assembly:<\/strong> Will the equipment take expertise to put together if needed? Do the brands offer any assembly services?<\/p><p><strong>Price:<\/strong> Do users get a good value for their money or are brands charging absurd prices for run-of-the-mill build quality and features?<\/p><p><strong>Warranty:<\/strong> Does the brand offer a money-back guarantee or a multi-year warranty?<\/p><p><strong>Shipping:<\/strong> How long does it take to receive the product? Is there free shipping? What happens when receiving a damaged product?<\/p><p><strong>Customer Service:<\/strong> Is the company attentive to responding to customer issues? Do they provide detailed descriptions of how to use the product and put it together (if needed)?<\/p>","button_label":"","button_link":"","text_size":"regular_text","text_alignment":"center"}},"99129cb1-8d89-4dde-97d5-70e1d2fc34a3":{"type":"image-text","settings":{"image":"shopify:\/\/shop_images\/Set_for_set_methodology.jpg","layout":"left","title":"Medical Review Process For Supplements","text":"<p>Once our content is produced by our expert content creators, we then have registered dietitians, nutritionists, MDs, and other qualified medical professionals review these posts to ensure accuracy when covering<br\/>products’ ingredients, claimed benefits, and potential side effects. <\/p><p>Our medical team suggests necessary edits, such as updating the cited sources and overall content. Once approved by our medical review team, the articles are published with their seal of approval as Fact Checked. <\/p>","button_label":"","button_link":"","text_alignment":"center"}}},"order":["main","f4d444c9-e648-41a1-8c6b-81b5438c4ae7","51af9aa5-56d2-4eb8-aa06-81a0a4571893","e96510f7-eedd-4a20-bd78-792d27ff6491","56c9f64c-387c-4851-a11b-dea9ff445406","13f5b4b8-9e94-4ea1-be58-78a021a45c07","eba2c934-54e2-4b80-ad3b-ff6e42f2230f","005a3c72-73c5-4c7b-95db-f6b0262f672c","af7be962-c9ae-4c4d-bd25-948091e459ab","99129cb1-8d89-4dde-97d5-70e1d2fc34a3"]}